Autodesk.Revit.DB.RoofBase.SlabShapeEditor
Get the SlabShapeEditor used for slab shape editing.
Remarks: Roofs cannot be attached to another roof, and the roof cannot be a curtain roof. If either of these conditions is not met, the ShapeEditor will be null.

Autodesk.Revit.DB.RoofBase.FasciaDepth
Retrieve or set the FasciaDepth.
Remarks: If the EaveCutterType is PlumbCut, this property doesn't make sense.

Autodesk.Revit.DB.RoofBase.EaveCuts
Retrieve or set the EaveCutterType.

Autodesk.Revit.DB.RoofBase.RoofType
Retrieve or set the Type.

Autodesk.Revit.DB.RoofBase
Represents all kinds of Roofs.
Remarks: The RoofBase object represents all kinds of roof in Revit.